
# a = {15:'a',27:'b',20:'c',19:'d',30:'e'}
          
# b = (sorted(a.keys()))
# print(b[-3:])


# Создайте класс Solution, создайте метод 
# longestPalindrome который принимает строку. 
# Учитывая строку s, верните самую длинную палиндромную подстроку в s.


# class Solution:
#       def longestPalindrome(self):
      

