# 1) Создайте функцию, которая будет принимать 2 числа,
#  складывать их и возвращать результат сложения.

# def summa():
#       a = 255
#       b = 135 
#       return a + b

# print(summa())
       


# 2) Создайте функцию, которая будет принимать строку. 
# Функция должна выводить длину этой строки.

# def lengt():
#       a = 'Stinger'
#       print(len(a))
# lengt()

# 3) Создайте функцию, которая принимает два обязательных параметра. 
# Задача этой функции выводить тип принятых аргументов.

# def tp(a,b): # Создаем функцию которая принимает два обязательных параметра
#       print(type(a)) #  выводим тип принятых аргументов.
#       print(type(b)) #  выводим тип принятых аргументов.

# a = 19 # передаем аргументы 
# b = 'scorpions' #  передаем аргументы 
# tp(a,b) # вызываем функцию


# 4) Создайте функцию, которая должна принимать 2 числа
#  и возвращать результат их деления.

# def t(a,b):
      
#       print(a/b)
#       return a/b  
      
# a = 125 
# b = 25 
# t(a,b)     
# print(t(a,b))

# 5) Создайте функцию, которая принимает словарь. 
# Пройдитесь по словарю циклом 
# и распечатайте все его ключи

# def abc():
# dict_ = {'color': 'blue', 'pet': 'dog', 'fruit': 'apple'}
# for key in dict_:
#       print(dict_.keys()


# 6) Создайте функцию, которая принимает и выводит 
# "It's odd number" если это число не кратно двум и "It's even number"
#  в противном случае.



# 7) Напишите функцию, которая будет принимать строку и проверять 
# является ли она палиндромом. Пробелы и регистр учитывать не нужно.
# (Палиндро́м, пе́ревертень — число, буквосочетание, слово или текст, 
# одинаково читающееся в обоих направлениях. Например, число 101; 
# слова "кок", "топот", "комок" и т.д.)



# 8) Создайте функцию которая принимает от пользователя два числа. 
# Она должна сравнить эти числа между собой и вывести максимальное значение.



# 9) Напишите функцию, которая принимает список чисел и возвращает их произведение.



# 10) Напишите функцию, которая принимает целое число и возвращает сумму всех его цифр. 


